In [1]:
#hdfs 대신 단순 csv를 읽어와서 데이터 처리 후 csv를 저장.
#sample 용으로 standalone으로 실제 작업시 mesos모드로 변경 필요

# spark 모듈 추가
from pyspark import SparkConf, SparkContext
from pyspark.sql import SparkSession

In [2]:
# 그외 모듈 추가
import pandas as pd
import numpy as np

In [3]:
# spark context 설정
conf = SparkConf().setAppName("paySparkApp")
sc = SparkContext(conf=conf)
# sparksession 생성
sparksession = SparkSession(sc)

In [4]:

# customer data 읽기
customer = sparksession.read.csv("data/origin/customer.csv", inferSchema=True, header=True)
customer.show(2)

# transaction data 읽기
transaction = sparksession.read.csv("data/origin/transaction.csv", inferSchema=True, header=True)
transaction.show(2)

+---+----+--------+-----------+
| id|name|birthday|nationality|
+---+----+--------+-----------+
|  1|null|    null|       null|
|  2|null|    null|       null|
+---+----+--------+-----------+
only showing top 2 rows

+---+-------------------+-----------+-------+
| id|   transaction_date|customer_id| amount|
+---+-------------------+-----------+-------+
|  1|2019-01-01 00:00:01|       3001| 543500|
|  2|2019-01-01 00:00:44|       3002|1633600|
+---+-------------------+-----------+-------+
only showing top 2 rows

In [5]:
#customer pandas 형태로 변환
new_customer=customer.toPandas()

In [6]:
new_customer.shape

(10000, 4)

In [7]:
new_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 4 columns):
id             10000 non-null int32
name           0 non-null object
birthday       0 non-null object
nationality    0 non-null object
dtypes: int32(1), object(3)
memory usage: 273.6+ KB

In [8]:
new_customer.head()

   id  name birthday nationality
0   1  None     None        None
1   2  None     None        None
2   3  None     None        None
3   4  None     None        None
4   5  None     None        None

In [9]:
#transaction pandas 형태로 변환
new_transaction=transaction.toPandas()

In [10]:
new_transaction.shape

(120000, 4)

In [11]:
new_transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120000 entries, 0 to 119999
Data columns (total 4 columns):
id                  120000 non-null int32
transaction_date    120000 non-null datetime64[ns]
customer_id         120000 non-null int32
amount              120000 non-null int32
dtypes: datetime64[ns](1), int32(3)
memory usage: 2.3 MB

In [12]:
new_transaction.head()

   id    transaction_date  customer_id   amount
0   1 2019-01-01 00:00:01         3001   543500
1   2 2019-01-01 00:00:44         3002  1633600
2   3 2019-01-01 00:01:27         3003   620400
3   4 2019-01-01 00:02:11         3004  1835600
4   5 2019-01-01 00:02:54         3005   408200

In [13]:
#최종적으로 결과가 적재될 customer_risk_result 생성
customer_risk_result = pd.DataFrame(columns=['base_yymm','customer_id','risk_score','risk_grade'])
customer_risk_result

Empty DataFrame
Columns: [base_yymm, customer_id, risk_score, risk_grade]
Index: []

In [14]:
#new_customer id값을 customer_risk_result에 적재
customer_risk_result['customer_id'] = new_customer['id']
customer_risk_result.head()

  base_yymm  customer_id risk_score risk_grade
0       NaN            1        NaN        NaN
1       NaN            2        NaN        NaN
2       NaN            3        NaN        NaN
3       NaN            4        NaN        NaN
4       NaN            5        NaN        NaN

In [15]:
#시스템 날짜 구하는 방법  (추후 적용)
import datetime, time
this_yymm = datetime.date.today()
# base_yymm = this_yymm.isoformat()   ## 진짜 현재 시간이 나와버려서.. 데이터랑 일치 X
base_yymm = '19-04-01'   ### 04월 부터 일단 달마다 계산하기.
start_yymm = 1  ### 3개월전 데이터
end_yymm = 3    ### 1개월전 데이터
print(base_yymm)

19-04-01

In [16]:
#배치돌리는 시간 적재 오늘 날짜가 19-04-01이라 가정
customer_risk_result['base_yymm'] = base_yymm
customer_risk_result.head()

  base_yymm  customer_id risk_score risk_grade
0  19-04-01            1        NaN        NaN
1  19-04-01            2        NaN        NaN
2  19-04-01            3        NaN        NaN
3  19-04-01            4        NaN        NaN
4  19-04-01            5        NaN        NaN

In [ ]:
#이제 risk_score...계산해야하는데...

In [ ]:
#3개월치 데이터만 뽑아보자. 추후에 시스템 날짜값 참조해서 바꾸어야함. (start_yymm~end_yymm)
# mask = (new_transaction['transaction_date'].dt.month >= 1) & (new_transaction['transaction_date'].dt.month <= 3)
# three_transaction = new_transaction[mask]
# three_transaction

In [ ]:
#1개월치 데이터만 뽑아보자. 추후에 시스템 날짜값 참조해서 바꾸어야함. (start_yymm~end_yymm)
# one_transaction = new_transaction[new_transaction['transaction_date'].dt.month == 3]
# one_transaction

In [ ]:
#1개월 거래금액을 customer_id로 그룹화 시키기
# one_group = one_transaction['amount'].groupby( one_transaction["customer_id"] )

In [ ]:
#1개월 거래금액 합 구하기
# one_sum = one_group.sum()
# print(one_sum)

In [ ]:
#3개월 거래금액을 customer_id로 그룹화 시키기
# three_group = three_transaction.groupby(["customer_id"] ).mean()
# print(three_group)
# three_group = three_transaction['amount'].groupby( three_transaction["customer_id"] )

In [17]:
### 생각해보니 각 달마다 사용자가 사용한 값을 구해서 csv로 저장시키는 것도 괜찮음
customer_month_pay = pd.DataFrame(columns=['customer_id']) 
customer_month_pay

Empty DataFrame
Columns: [customer_id]
Index: []

In [18]:
sort_new_transaction = new_transaction.sort_values(by='customer_id')
sort_new_transaction

          id    transaction_date  customer_id   amount
0          1 2019-01-01 00:00:01         3001   543500
10891  10892 2019-01-11 10:41:32         3001   769200
20774  20775 2019-01-21 09:17:18         3001  1686500
22615  22616 2019-01-23 07:22:49         3001   857900
4043    4044 2019-01-05 00:30:59         3001  1982900
...      ...                 ...          ...      ...
65998  65999 2019-03-07 23:58:35         9999  1673100
89998  89999 2019-03-31 23:58:35         9999  1173400
23998  23999 2019-01-24 23:58:35         9999  1637800
11998  11999 2019-01-12 23:58:35         9999   726000
41998  41999 2019-02-11 23:58:35         9999  1354200

[120000 rows x 4 columns]

In [19]:
# transaction_date month 별로 index 생성
sort_new_transaction['transaction_date']=sort_new_transaction['transaction_date'].map(lambda x: x.strftime('%m'))
sort_new_transaction

          id transaction_date  customer_id   amount
0          1               01         3001   543500
10891  10892               01         3001   769200
20774  20775               01         3001  1686500
22615  22616               01         3001   857900
4043    4044               01         3001  1982900
...      ...              ...          ...      ...
65998  65999               03         9999  1673100
89998  89999               03         9999  1173400
23998  23999               01         9999  1637800
11998  11999               01         9999   726000
41998  41999               02         9999  1354200

[120000 rows x 4 columns]

In [20]:
#달마다 회원별 구매액 계산완료 
month_transaction=sort_new_transaction.groupby(['customer_id','transaction_date']).sum()
month_transaction.reset_index(level=['customer_id','transaction_date'], inplace = True)
month_transaction

       customer_id transaction_date      id    amount
0             3001               01   67893   7062500
1             3002               01   67899   5678800
2             3003               01   67905   6107200
3             3004               01   67911  10084000
4             3005               01   67917   7073400
...            ...              ...     ...       ...
25295         9998               04  539990   4232500
25296         9999               01   89995   5631500
25297         9999               02  179996   2674800
25298         9999               03  449994   5972200
25299         9999               04  539995   5961100

[25300 rows x 4 columns]

In [21]:
month_transaction[month_transaction['customer_id']==4001]

      customer_id transaction_date      id   amount
1304         4001               01   90005  4841900
1305         4001               02  180004  4437700
1306         4001               03  360005  6577500
1307         4001               04  510005  4332700

In [22]:
#1월달의 데이터 제거 총 3개월의 데이터
three_month_pay = month_transaction[month_transaction.transaction_date != '01']
three_month_pay

       customer_id transaction_date      id    amount
100           3101               02  256558  10380600
101           3102               02  256565   7370400
102           3103               02  256572   8473300
103           3104               02  256579   8266900
104           3105               02  256586   5757500
...            ...              ...     ...       ...
25294         9998               03  449988   6191200
25295         9998               04  539990   4232500
25297         9999               02  179996   2674800
25298         9999               03  449994   5972200
25299         9999               04  539995   5961100

[19000 rows x 4 columns]

In [23]:
# 3개월의 데이터 중 평균 값 구하기
tree_month_mean=three_month_pay.groupby(['customer_id']).mean()
tree_month_mean.reset_index(level=['customer_id'], inplace = True)
tree_month_mean=tree_month_mean.drop('id',axis=1)
tree_month_mean

      customer_id        amount
0            3101  1.038060e+07
1            3102  7.370400e+06
2            3103  8.473300e+06
3            3104  8.266900e+06
4            3105  5.757500e+06
...           ...           ...
6695         9995  5.659667e+06
6696         9996  5.102167e+06
6697         9997  6.056833e+06
6698         9998  5.150567e+06
6699         9999  4.869367e+06

[6700 rows x 2 columns]

In [33]:
# 3개월의 데이터 중 최소 값 구하기
tree_month_min=three_month_pay.groupby(['customer_id']).min()
tree_month_min.reset_index(level=['customer_id'], inplace = True)
tree_month_min=tree_month_min.drop(['transaction_date','id'],axis=1)
tree_month_min

      customer_id    amount
0            3101  10380600
1            3102   7370400
2            3103   8473300
3            3104   8266900
4            3105   5757500
...           ...       ...
6695         9995   4504500
6696         9996   3417300
6697         9997   4956600
6698         9998   4232500
6699         9999   2674800

[6700 rows x 2 columns]

In [ ]:
# 3개월의 데이터 중 최대 값 구하기
tree_month_max=three_month_pay.groupby(['customer_id']).max()
tree_month_max.reset_index(level=['customer_id'], inplace = True)
tree_month_max=tree_month_max.drop(['transaction_date','id'],axis=1)
tree_month_max

In [ ]:
### 각 사용자가 각 달마다 사용한 값 저장
customer_month_pay['customer_id'] = new_transaction.drop_duplicates('customer_id',keep='first')['customer_id']
customer_month_pay


customer_id = new_transaction.drop_duplicates('customer_id',keep='first')
customer_month_pay['customer_id'] = customer_id['customer_id']
customer_month_pay

In [ ]:
#원본데이터를 보니 4개월치밖에 없었음.
for idx in range(1,5):
    one_transaction = new_transaction[new_transaction['transaction_date'].dt.month == idx]
#     one_group = one_transaction['amount'].groupby( one_transaction["customer_id"] ).sum().to_frame()
    one_group = one_transaction.groupby('customer_id')["amount"].sum().reset_index(name =idx)
    customer_month_pay=pd.merge(customer_month_pay,one_group,on="customer_id")

In [ ]:
#1월부터 4월까지 사용자들이 사용한 월당 값 출력
customer_month_pay   #총 6000 row 확인 완료 / 실거래자가 6천명이라는 뜻

In [ ]:
#일단 구한 값 csv 저장
customer_month_pay.to_csv("data/dest/customer_month_pay.csv", mode='w')

In [ ]:
#누적확률 = (3개월 거래금액 평균-3개월 거래금액 최소값) / (3개월 거래금액 최대값-3개월 거래금액 최소값)

In [ ]:
# three_customer_month_pay=customer_month_pay.iloc[:,2:5]
# three_customer_month_pay.head()

In [ ]:
#3개월 거래금액 최소값
three_min=three_customer_month_pay.min(axis=1)
three_min

In [ ]:
#3개월 거래금액 최대값
three_max=three_customer_month_pay.max(axis=1)
print(three_max)

In [ ]:
#3개월 거래금액 평균
three_mean=three_customer_month_pay.mean(axis=1)
print(three_mean)

In [ ]:
#누적확률 = (3개월 거래금액 평균-3개월 거래금액 최소값) / (3개월 거래금액 최대값-3개월 거래금액 최소값)
cumulative_probability = (three_mean-three_min)/(three_max-three_min)
print(cumulative_probability)

In [ ]:
#고객의 최근 1개월 거래 금액
one_customer_month_pay=customer_month_pay.iloc[:,4:5]
print(one_customer_month_pay)

In [ ]:
print(cumulative_probability*100)

print(one_customer_month_pay)
customer_level = (one_customer_month_pay)/(cumulative_probability)
print(customer_level[4])

In [ ]:
print(customer_risk_result)

In [ ]:
#application 닫기
sc.stop()

In [ ]:
## 별첨.
# grade_base 만들기
dict = {'grade':["A","B","C"],
       'min_score': ["71","31","0"],
       'max_score': ["100","70","30"]}
grade_base = pd.DataFrame(dict)
print(grade_base)

In [ ]:
# csv 저장하기
grade_base.to_csv("data/dest/grade_base.csv", mode='w')